# Pandas

* Pandas is a Python library that provides high-performance data structures .
* The name Pandas comes from the fusion of the words Panel and Data.
* Pandas is easy to use alongside other Python analysis tools.
* Pandas depends on NumPy , which means it is built " on top " of the NumPy library and depends on it .
* Pandas only works if you also have NumPy installed :
* If NumPy is already installed, Pandas is installed as usual
* Otherwise, installing Pandas will also install its " dependencies ", including NumPy .
* It is the basic tool, together with NumPy , for representing scientific information and datasets which will then be given as input to AI and ML tools.
* It is open-source and freely accessible (BSD, free license).

## Motivazioni

Using Pandas we can perform the 5 (+ 1) typical steps of data processing and analysis. Some typical possible operations offered by the tool are:
* Management of missing data
* Dividing, indexing and searching information in large data sets
* Ability to modify the data structure (deletion, addition, manipulation of rows and columns)
* Data grouping and transformation
* Time series management.

## Pandas Data Structures

The data structures generally managed by Pandas are tabulated (i.e. in
the form of tables) and sequential:
* **Series**: data in one-dimensional format (such as arrays or lists ), for managing sequences or time series; can contain objects of arbitrary type.
* **Dataframe**: data in two-dimensional format ( tables or matrices )


## Main topics

* pandas data frame
* df dimensioni e caratteristiche
* selezionare righe e colonne
* cicli
* operazioni base su dataframe
* eliminare righe e colonne
* gestire i valorei NaN
* concatenare df (rowbind, colbind)
* merge (join) di dataframe
* group-by
* long wide format
* database, excel

# Pandas Data Frame

In [3]:
import pandas as pd
import numpy as np

In [14]:
data = {'col1':[1,2,3,4],'col2':[4,5,6,7]}
data

{'col1': [1, 2, 3, 4], 'col2': [4, 5, 6, 7]}

In [15]:
data['col1'][0]

1

In [22]:
df1 = pd.DataFrame(data)
df1

   col1  col2
0     1     4
1     2     5
2     3     6
3     4     7

In [77]:
data = df1.to_dict()

In [78]:
data['col1'][0]

1

# DataFrame dimensione e caratteristiche

In [79]:
df1.shape

(4, 2)

In [80]:
df1.shape[0]

4

In [81]:
df1.dtypes

col1    int64
col2    int64
dtype: object

In [82]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      int64
 1   col2    4 non-null      int64
dtypes: int64(2)
memory usage: 196.0 bytes

In [83]:
df1.describe()

           col1      col2
count  4.000000  4.000000
mean   2.500000  5.500000
std    1.290994  1.290994
min    1.000000  4.000000
25%    1.750000  4.750000
50%    2.500000  5.500000
75%    3.250000  6.250000
max    4.000000  7.000000

In [25]:
data = pd.read_csv('../../dataset/autoMpg.csv')

In [85]:
data

,cylinders,displacement,horsepower,weight,acceleration,model,origin,mpg
0,8,307.0,130,3504,12.0,70,1,18.0
1,8,350.0,165,3693,11.5,70,1,15.0
2,8,318.0,150,3436,11.0,70,1,18.0
3,8,304.0,150,3433,12.0,70,1,16.0
4,8,302.0,140,3449,10.5,70,1,17.0
...,...,...,...,...,...,...,...,...
393,4,140.0,86,2790,15.6,82,1,27.0
394,4,97.0,52,2130,24.6,82,2,44.0
395,4,135.0,84,2295,11.6,82,1,32.0
396,4,120.0,79,2625,18.6,82,1,28.0
397,4,119.0,82,2720,19.4,82,1,31.0

In [86]:
data.shape

(398, 8)

In [87]:
data.dtypes

cylinders         int64
displacement    float64
horsepower       object
weight            int64
acceleration    float64
model             int64
origin            int64
mpg             float64
dtype: object

In [88]:
data.describe()

,cylinders,displacement,weight,acceleration,model,origin,mpg
count,398.000000,398.000000,398.000000,398.000000,398.000000,398.000000,398.000000
mean,5.454774,193.425879,2970.424623,15.568090,76.010050,1.572864,24.125126
std,1.701004,104.269838,846.841774,2.757689,3.697627,0.802055,14.619190
min,3.000000,68.000000,1613.000000,8.000000,70.000000,1.000000,9.000000
25%,4.000000,104.250000,2223.750000,13.825000,73.000000,1.000000,17.500000
50%,4.000000,148.500000,2803.500000,15.500000,76.000000,1.000000,23.000000
75%,8.000000,262.000000,3608.000000,17.175000,79.000000,2.000000,29.000000
max,8.000000,455.000000,5140.000000,24.800000,82.000000,3.000000,270.000000

# Seleziona righe e colonne di interesse

In [23]:
#dfx = data.loc[[1,5,8],['cylinders','model','mpg']]
#dfx.loc[:,['model']]
#data.iloc[[1,5,8],[-1]]

df1.index = ['marco','matteo','anna','roberta']
df1

         col1  col2
marco       1     4
matteo      2     5
anna        3     6
roberta     4     7

In [90]:
df1.loc[['marco'],['col1']]
df1.iloc[[0],[0]]

       col1
marco     1

In [91]:
x = data[(data['cylinders'] > 4) & (data['cylinders'] <= 6)]
x.head()
x = data[data['cylinders'].isin([4,8])]
x.sort_values(['weight'])

,cylinders,displacement,horsepower,weight,acceleration,model,origin,mpg
54,4,72.0,69,1613,18.0,71,3,35.0
144,4,76.0,52,1649,16.5,74,3,31.0
343,4,79.0,58,1755,16.9,81,3,39.1
345,4,81.0,60,1760,16.1,81,3,35.1
53,4,71.0,65,1773,19.0,71,3,31.0
...,...,...,...,...,...,...,...,...
95,8,455.0,225,4951,11.0,73,1,12.0
90,8,429.0,198,4952,11.5,73,1,12.0
42,8,383.0,180,4955,11.5,71,1,12.0
103,8,400.0,150,4997,14.0,73,1,11.0
44,8,400.0,175,5140,12.0,71,1,13.0

# Cicli e operazioni esterne a pandas

In [92]:
x = data.to_dict()
sum(x['cylinders'].values())

TypeError: 'int' object is not callable

In [ ]:
sum = 0
for i,row in data.iterrows():
    sum += row['cylinders']
print(sum)

2171

# Operazioni Base

In [24]:
df1 = df1.reset_index()
df1.columns = ['nome','col1','col2']
df1

      nome  col1  col2
0    marco     1     4
1   matteo     2     5
2     anna     3     6
3  roberta     4     7

In [ ]:
sdf1 = df1.sort_values(['col2'], ascending=False)
sdf1.iloc[0,:]

col1    4
col2    7
Name: roberta, dtype: int64

In [ ]:
xx = data['cylinders'].value_counts().to_frame()
xx.columns = ['tot']
xx['cylinders'] = xx.index
xx

           tot  cylinders
cylinders
4          204          4
8          103          8
6           84          6
3            4          3
5            3          5

In [26]:
cyl = list(data['cylinders'].unique())
cyl

[np.int64(8), np.int64(4), np.int64(6), np.int64(3), np.int64(5)]

In [28]:
data.loc[data['cylinders']==cyl[0],:].shape[0]

103

In [ ]:
list(data.columns)

['cylinders',
 'displacement',
 'horsepower',
 'weight',
 'acceleration',
 'model',
 'origin',
 'mpg']

In [29]:
df1

      nome  col1  col2
0    marco     1     4
1   matteo     2     5
2     anna     3     6
3  roberta     4     7

In [31]:
df1['col3'] = df1['col2'] / df1['col1']
df1

      nome  col1  col2  col3
0    marco     1     4  4.00
1   matteo     2     5  2.50
2     anna     3     6  2.00
3  roberta     4     7  1.75

In [32]:
df1.loc[:,['col1']].mean()

col1    2.5
dtype: float64

In [34]:
df1.loc[df1['nome']=='marco',:].sum()

nome    marco
col1        1
col2        4
col3      4.0
dtype: object

In [ ]:
dfo = pd.DataFrame({'col1':[1000,2,3,4], 'col2':[4,5,6,7]})
dfo

   col1  col2
0  1000     4
1     2     5
2     3     6
3     4     7

In [ ]:
df1 = dfo.copy()
# modificare singole righe di un data frame
df1.loc[0,:] = [1,4]
  
df1.loc[:,['col1']] = [[2],[2],[2],[2]]

for index,row in df1.iterrows():
    if row['col2'] > 5:
        row['col1'] = 1
 
df1.columns = ['val1','val2']
df1.index = ['a','b','c','d']
#df1['nome'] = df1.index
df1 = df1.reset_index()
df1

  index  val1  val2
0     a     2     4
1     b     2     5
2     c     1     6
3     d     1     7

In [35]:
df1

      nome  col1  col2  col3
0    marco     1     4  4.00
1   matteo     2     5  2.50
2     anna     3     6  2.00
3  roberta     4     7  1.75

In [36]:
#apply
def f(row):
    if row['col2'] > 5:
        return row['col1'] + row['col2']
    else:
        return row['col2']
df1['col4'] = df1.apply(f,axis='columns')
df1

      nome  col1  col2  col3  col4
0    marco     1     4  4.00     4
1   matteo     2     5  2.50     5
2     anna     3     6  2.00     9
3  roberta     4     7  1.75    11

In [ ]:
def f2(v):
    if v == 1:
        return True
    else:
        return False

df1['val1'] = df1['val1'].apply(lambda v : True if v == 1 else False )
df1

# gestione NaN

In [37]:
df1 = pd.DataFrame({'col1':[1,np.nan,3,4],'col2':[4,5,np.nan,np.nan]})
df1

   col1  col2
0   1.0   4.0
1   NaN   5.0
2   3.0   NaN
3   4.0   NaN

In [39]:
df1['col2'].mean()

np.float64(4.5)

In [40]:
df1.loc[df1['col2'].isna(),'col2'] = 0
df1

   col1  col2
0   1.0   4.0
1   NaN   5.0
2   3.0   0.0
3   4.0   0.0

In [41]:
df1.loc[df1['col1'].isna(),'col1'] = df1['col1'].mean()
df1

       col1  col2
0  1.000000   4.0
1  2.666667   5.0
2  3.000000   0.0
3  4.000000   0.0

In [ ]:
#df1['col1'] = df1['col1'].apply(lambda v : 0 if pd.isna(v) else v)
#df1['col2'] = df1['col2'].apply(lambda v : 0 if pd.isna(v) else v)
df1[df1.isna()] = 0
df1[df1 > 3] = 1
df1

   col1  col2
0   1.0   1.0
1   0.0   1.0
2   3.0   0.0
3   1.0   0.0

In [ ]:
#df1 = df1.fillna(0)

In [ ]:
df1 = df1.fillna(method='ffill',axis='columns')
df1 = df1.fillna(method='bfill',axis='columns')
df1

C:\Users\marco\AppData\Local\Temp\ipykernel_44728\2021892506.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df1 = df1.fillna(method='ffill',axis='columns')
C:\Users\marco\AppData\Local\Temp\ipykernel_44728\2021892506.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df1 = df1.fillna(method='bfill',axis='columns')

   col1  col2
0   1.0   1.0
1   0.0   1.0
2   3.0   0.0
3   1.0   0.0

# Elimina Righe e Colonne

In [42]:
df1 = pd.DataFrame({'col1':[1,np.nan,3,4],'col2':[4,5,np.nan,np.nan]})
df1

   col1  col2
0   1.0   4.0
1   NaN   5.0
2   3.0   NaN
3   4.0   NaN

In [43]:
df2 = df1.drop([1])
df2

   col1  col2
0   1.0   4.0
2   3.0   NaN
3   4.0   NaN

In [44]:

df2 = df1.drop(['col1'],axis='columns')
df2

   col2
0   4.0
1   5.0
2   NaN
3   NaN

In [ ]:



x = []
for index,row in df1.iterrows():
    if pd.isna(row['col1']) or pd.isna(row['col2']):
        x.append(index)
df2 = df1.drop(x)
df2

df2 = df1.dropna(axis='rows')
df2

   col1  col2
0   1.0   4.0

# Unione di Dataframe

In [45]:
df1 = pd.DataFrame({'col1':[1,2,3],'col2':[4,5,6]})
df2 = pd.DataFrame({'col2':[9,9,9],'col1':[8,8,8]})
df1

   col1  col2
0     1     4
1     2     5
2     3     6

In [46]:
df2

   col2  col1
0     9     8
1     9     8
2     9     8

In [48]:
df = pd.concat([df1,df2])
df

   col1  col2
0     1     4
1     2     5
2     3     6
0     8     9
1     8     9
2     8     9

In [49]:
df = pd.concat([df1,df2]).reset_index().drop(['index'],axis='columns')
df

   col1  col2
0     1     4
1     2     5
2     3     6
3     8     9
4     8     9
5     8     9

In [50]:
df3 = pd.DataFrame({'col3':[10,20,30,40,50,60]})
df3

   col3
0    10
1    20
2    30
3    40
4    50
5    60

In [51]:
df = pd.concat([df,df3],axis='columns')
df

   col1  col2  col3
0     1     4    10
1     2     5    20
2     3     6    30
3     8     9    40
4     8     9    50
5     8     9    60

In [ ]:
df1.index = ['marco','matteo','roberta']
df3 = pd.DataFrame({'col3':[1,2,3],'col4':[4,5,6]})
df3.index = ['marco','roberta','matteo']
df = pd.concat([df1,df3],axis='columns')
df

         col1  col2  col3  col4
marco       1     4     1     4
matteo      2     5     3     6
roberta     3     6     2     5

In [52]:
df1 = pd.DataFrame({'persone':['marco','matteo','roberta','mattia'], 'gruppo':['A','A','B','B']})
df2 = pd.DataFrame({'people':['marco','roberta','matteo','luca'], 'anno':['2000','2005','2020','2010']})
print(df1)
print('-------')
print(df2)

   persone gruppo
0    marco      A
1   matteo      A
2  roberta      B
3   mattia      B
-------
    people  anno
0    marco  2000
1  roberta  2005
2   matteo  2020
3     luca  2010

In [57]:
df = df1.merge(df2,left_on='persone',right_on='people', how='outer')
df

   persone gruppo   people  anno
0      NaN    NaN     luca  2010
1    marco      A    marco  2000
2   matteo      A   matteo  2020
3   mattia      B      NaN   NaN
4  roberta      B  roberta  2005

In [ ]:
df

  gruppo   people  anno
0      A    marco  2000
1      B  roberta  2005
2      A   matteo  2020
3    NaN     luca  2010

In [ ]:
df1 = pd.DataFrame({'nome':['marco','matteo','marco'],
                   'cognome':['mamei','mamei','picone'],
                  'val':[1,2,3]})
df2 = pd.DataFrame({'nome':['marco','matteo','marco'],
                   'cognome':['mamei','mamei','mamei'],
                  'val':[4,5,6]})

In [ ]:
df1.columns = ['nome','cognome','val1']
df1.columns = ['nome','cognome','val2']
df = df1.merge(df2)

In [ ]:
df

     nome cognome  val2  val
0   marco   mamei     1    4
1   marco   mamei     1    6
2  matteo   mamei     2    5

# Groupby e Aggregate

In [ ]:
df = pd.DataFrame({'nome':['marco','matteo','roberta','mattia'],
                 'gruppo':['A','A','B','B'],
                 'val1':[1,2,3,4],
                 'val2':[4,5,6,7]})
df

      nome gruppo  val1  val2
0    marco      A     1     4
1   matteo      A     2     5
2  roberta      B     3     6
3   mattia      B     4     7

In [ ]:
gdf = df.groupby(['gruppo'])[['val1','val2']].mean().reset_index()
gdf

  gruppo  val1  val2
0      A   1.5   4.5
1      B   3.5   6.5

In [ ]:

def f(x):
    return max(list(x))

gdf = df.groupby(['gruppo']).aggregate({'val1':[np.size,np.mean,f]}).reset_index()
gdf.columns = ['gruppo','size','mean','f']
gdf

C:\Users\marco\AppData\Local\Temp\ipykernel_44728\1028439471.py:4: FutureWarning: The provided callable <function mean at 0x0000028B2DED0A40> is currently using SeriesGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  gdf = df.groupby(['gruppo']).aggregate({'val1':[np.size,np.mean,f]}).reset_index()

  gruppo  size  mean  f
0      A     2   1.5  2
1      B     2   3.5  4

In [ ]:
gdf = df.groupby(['gruppo','nome'])['val1'].count().reset_index()
gdf

  gruppo     nome  val1
0      A    marco     1
1      A   matteo     1
2      B   mattia     1
3      B  roberta     1

In [ ]:
gdf = df.groupby(['gruppo']).apply(lambda xdf: xdf['val1'].max()).reset_index()
gdf

C:\Users\marco\AppData\Local\Temp\ipykernel_44728\1696142228.py:1: FutureWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  gdf = df.groupby(['gruppo']).apply(lambda xdf: xdf['val1'].max()).reset_index()

  gruppo  0
0      A  2
1      B  4

# Long e Wide Format

### wide
nome, val1, val2

marco, 1,2

matteo,3,4

...

### long
nome, var, val

marco, val1, 1

marco, val2, 2

matteo, val1, 3

matteo, val2, 4

...

In [ ]:
import pandas as pd
# wide ---> long (melt)
wide = pd.DataFrame({'nome':['marco','mattia','roberta'],
                    'val1':[1,2,3],
                    'val2':[4,5,6]})
wide
long = wide.melt(id_vars=['nome'],value_vars = ['val1','val2'])
long

wide = pd.DataFrame({'riga':[1,2,3],'c1':[34,45,56],'c2':[34,45,56],'c3':[34,45,56]})
long = wide.melt(id_vars=['riga'],value_vars = ['c1','c2','c3'])
long

   riga variable  value
0     1       c1     34
1     2       c1     45
2     3       c1     56
3     1       c2     34
4     2       c2     45
5     3       c2     56
6     1       c3     34
7     2       c3     45
8     3       c3     56

In [ ]:
# long --> wide (pivot_table)

wide = long.pivot_table(index=['riga'],columns='variable',values='value').reset_index()
wide.columns.name = ''
wide

   riga    c1    c2    c3
0     1  34.0  34.0  34.0
1     2  45.0  45.0  45.0
2     3  56.0  56.0  56.0

# Extra Data Sources

## Database

In [ ]:
# create a simple sqlite database
import sqlite3

# Connect to a new database file (creates it if it doesn't exist)
conn = sqlite3.connect('example.db')

# Create a cursor object
cur = conn.cursor()

# Create a simple table
cur.execute('''CREATE TABLE IF NOT EXISTS users (id INTEGER PRIMARY KEY, name TEXT, age INTEGER)''')

# Insert some data
cur.execute("INSERT INTO users (name, age) VALUES (?, ?)", ('Alice', 30))
cur.execute("INSERT INTO users (name, age) VALUES (?, ?)", ('Bob', 25))
cur.execute("INSERT INTO users (name, age) VALUES (?, ?)", ('Marco', 25))
cur.execute("INSERT INTO users (name, age) VALUES (?, ?)", ('Matteo', 26))

# Commit changes and close connection
conn.commit()
conn.close()

In [ ]:
# access the db in pandas
import pandas as pd
import sqlite3

# Connect to the database
conn = sqlite3.connect('example.db')

# Read the 'users' table into a pandas DataFrame
df_users = pd.read_sql_query("SELECT * FROM users", conn)

# Close the connection
conn.close()
df_users

    id    name  age
0    1   Alice   30
1    2     Bob   25
2    3   Marco   25
3    4  Matteo   26
4    5   Alice   30
5    6     Bob   25
6    7   Marco   25
7    8  Matteo   26
8    9   Alice   30
9   10     Bob   25
10  11   Marco   25
11  12  Matteo   26

## Excel

In [ ]:
# read excel in pandas
import pandas as pd

# Read an Excel file (replace 'yourfile.xlsx' with your actual file path)
df_excel = pd.read_excel('example.xlsx')
df_excel.head()

      Nome Cognome  Età
0    Marco   Mamei   49
1  Matteo    Mamei   45
2  Roberta     NaN   43